tutorials/cfdemSolverIBTorque/falling_sphere_two_way_coupling/CFD/constant/couplingProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          couplingProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//===========================================================================//
// sub-models & settings

modelType none;

checkPeriodicCells;

verbose;

couplingInterval 10;

depth 0;

voidFractionModel IB;//bigParticle;//centre; //

locateModel engineIB;//standard;//

meshMotionModel noMeshMotion;

regionModel allRegion;

dataExchangeModel twoWayMPI;//twoWayFiles;

IOModel basicIO;

probeModel off;

averagingModel dilute;

clockModel off;

smoothingModel off;

forceModels
(
    ShirgaonkarIBTorque
    ArchimedesIB
);

momCoupleModels
(
);

turbulenceModelType "turbulenceProperties";

//===========================================================================//
// sub-model properties

ShirgaonkarIBTorqueProps
{
    velFieldName "U";
    pressureFieldName "p";
    densityFieldName "rho";
    verbose;
    useTorque;
}

ArchimedesIBProps
{
    densityFieldName "rho";
    gravityFieldName "g";
    voidfractionFieldName "voidfractionNext";
}

twoWayFilesProps
{
    maxNumberOfParticles 10000;
    DEMts 0.00003;
}

twoWayMPIProps
{
    maxNumberOfParticles 10100;
    liggghtsPath "../DEM/in.liggghts_run";
}

IBProps
{
    maxCellsPerParticle 20000;
    alphaMin 0.30;
    scaleUpVol 1.0;
}

bigParticleProps
{
    maxCellsPerParticle 1000;
    alphaMin 0.30;
    scaleUpVol 1.0;
}
centreProps
{
    alphaMin 0.30;
}

dividedProps
{
    alphaMin 0.05;
    scaleUpVol 1.2;
}

engineIBProps
{
    engineProps
    {
        treeSearch false;
    }
    zSplit 8;
    xySplit 16;
}

// ************************************************************************* //
